NetologySlow/src/Documents/УстановкаЦен/УстановкаЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦен</name>
  <registerRecords>InformationRegister.Цены</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

NetologySlow/src/Documents/УстановкаЦен/Forms/ФормаДокумента/Module.bsl
//Создать клиентскую процедуру ПриИзмененииНоменклатуры 
 //с параметром ИзмененнаяСтрока (ДанныеФормыЭлементКоллекции), в которой, если Номенклатура заполнена, вызвать ЦеныВызовСервера.ЦенаНаДату и заполнить цену.
 
 &НаКлиенте
 Процедура ЦеныНоменклатураПриИзменении(Элемент)    //1.0 Номенклатура     
	 //вызвать процедуру ПриИзмененииНоменклатуры с передачей текущих данных таблицы цен. 
	 //ПриИзмененииНоменклатуры (ИзмененнаяСтрока);      
	 ИзмененнаяСтрока=Элементы.Цены.ТекущиеДанные; 
	 ПриИзмененииНоменклатуры(ИзмененнаяСтрока); 
 КонецПроцедуры    
 
 &НаКлиенте
 Процедура ПриИзмененииНоменклатуры (ИзмененнаяСтрока)     //1.1 Номенклатура	 
	 Если ЗначениеЗаполнено(ИзмененнаяСтрока.Номенклатура) Тогда 
		 Номенклатура=ИзмененнаяСтрока.Номенклатура; 
		 Дата=Объект.Дата; 
		 ЦенаНоменклатуры=ЦеныВызовСервера.ЦенаНаДату(Номенклатура,Дата); 
		 ИзмененнаяСтрока.Цена=ЦенаНоменклатуры; 
	 КонецЕсли; 
	 
 КонецПроцедуры
 
 &НаКлиенте
 Процедура Подбор(Команда)  //3
	 
	 //открыть //форму выбора справочника Номенклатура// с параметром ЗакрыватьПриВыборе = Ложь, указав в качестве владельца таблицу цен.  
	 ПараметрыФормы=Новый Структура; 
	 ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь); 
	 ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",ПараметрыФормы,Элементы.Цены); 
	 
 КонецПроцедуры
 
 &НаКлиенте
 Процедура ЦеныОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)     //4
	СтандартнаяОбработка=Ложь;  
	//если в таблице еще нет выбранного значения - добавить строку и вызвать процедуру ПриИзмененииНоменклатуры, передав добавленную строку. 
	ЭлементВыбора=Новый Структура; 
	ЭлементВыбора.Вставить("Номенклатура",ВыбранноеЗначение); 
	Результат=Объект.Цены.НайтиСтроки(ЭлементВыбора); 
	
	Если Результат.Количество()=0 Тогда
		ИзмененнаяСтрока=Объект.Цены.Добавить(); 
		ИзмененнаяСтрока.Номенклатура=ВыбранноеЗначение; 
		ПриИзмененииНоменклатуры(ИзмененнаяСтрока);  
	Иначе Сообщить(СтрШаблон("Номенклатура %1 уже есть в списке", ВыбранноеЗначение)); 
    КонецЕсли; 
 КонецПроцедуры
